_org/_posts/db/2018-10-15-mysql.org
#+begin_export html
---
layout: post
title: "MySQL 学习"
date: 2018-10-15
categories: 数据存储
tags:
    - MySQL
excerpt:
keywords: ""
---
#+end_export

* 数据库安装

安装前，我们可以检测系统是否自带安装 MySQL:

#+begin_src shell
rpm -qa | grep mysql
#+end_src

如果你系统有安装，那可以选择进行卸载:

#+begin_src shell
# 普通删除模式
rpm -e mysql
# 强力删除模式，如果使用上面命令删除时，提示有依赖的其它文件
# 则用该命令可以对其进行强力删除
rpm -e --nodeps mysql
#+end_src

安装 MySQL：

接下来我们在 Centos7 系统下使用 yum 命令安装 MySQL，需要注意的是 CentOS 7 版本中 MySQL 数据库已从默认的程序列表中移除，所以在安装前我们需要先去官网下载 Yum 资源包，下载地址为：<https://dev.mysql.com/downloads/repo/yum/>。

#+begin_src shell
wget http://repo.mysql.com/mysql-community-release-el7-5.noarch.rpm
rpm -ivh mysql-community-release-el7-5.noarch.rpm
yum update
yum install mysql-server
#+end_src

初始化 MySQL：

#+begin_src shell
mysqld --initialize
#+end_src

启动 MySQL：

#+begin_src shell
systemctl start mysqld
#+end_src

查看 MySQL 运行状态：

#+begin_src shell
systemctl status mysqld
#+end_src

验证 MySQL 安装

在成功安装 MySQL 后，一些基础表会表初始化，在服务器启动后，你可以通过简单的测试来验证 MySQL 是否工作正常。

使用 mysqladmin 工具来获取服务器状态：

使用 mysqladmin 命令俩检查服务器的版本, 在 linux 上该二进制文件位于 /usr/bin 目录，在 Windows 上该二进制文件位于 C:\mysql\bin。

#+begin_src shell
mysql --version
mysqladmin --version
#+end_src

使用 MySQL Client(Mysql 客户端) 执行简单的 SQL 命令

你可以在 MySQL Client(Mysql 客户端) 使用 mysql 命令连接到 MySQL 服务器上，默认情况下 MySQL 服务器的登录密码为空，所以本实例不需要输入密码。

命令如下：

#+begin_src shell
mysql
#+end_src

Mysql 安装后需要做的

Mysql 安装成功后，默认的 root 用户密码为空，你可以使用以下命令来创建 root 用户的密码：

#+begin_src shell
[root@host]# mysqladmin -u root password "new_password";
#+end_src

现在你可以通过以下命令来连接到 Mysql 服务器：

#+begin_src shell
mysql -u root -p
#+end_src

