_posts/db/2018-10-15-mysql.html
---
layout: post
title: "MySQL 学习"
date: 2018-10-15
categories: 数据存储
tags:
    - MySQL
excerpt:
keywords: ""
---

<div id="outline-container-org66b90c0" class="outline-2">
<h2 id="org66b90c0"><span class="section-number-2">1</span> 数据库安装</h2>
<div class="outline-text-2" id="text-1">
<p>
安装前，我们可以检测系统是否自带安装 MySQL:
</p>

<div class="org-src-container">
<pre class="src src-shell">rpm -qa | grep mysql
</pre>
</div>

<p>
如果你系统有安装，那可以选择进行卸载:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#26222;&#36890;&#21024;&#38500;&#27169;&#24335;</span>
rpm -e mysql
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#24378;&#21147;&#21024;&#38500;&#27169;&#24335;&#65292;&#22914;&#26524;&#20351;&#29992;&#19978;&#38754;&#21629;&#20196;&#21024;&#38500;&#26102;&#65292;&#25552;&#31034;&#26377;&#20381;&#36182;&#30340;&#20854;&#23427;&#25991;&#20214;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#21017;&#29992;&#35813;&#21629;&#20196;&#21487;&#20197;&#23545;&#20854;&#36827;&#34892;&#24378;&#21147;&#21024;&#38500;</span>
rpm -e --nodeps mysql
</pre>
</div>

<p>
安装 MySQL：
</p>

<p>
接下来我们在 Centos7 系统下使用 yum 命令安装 MySQL，需要注意的是 CentOS 7 版本中 MySQL 数据库已从默认的程序列表中移除，所以在安装前我们需要先去官网下载 Yum 资源包，下载地址为：<a href="https://dev.mysql.com/downloads/repo/yum/">https://dev.mysql.com/downloads/repo/yum/</a>。
</p>

<div class="org-src-container">
<pre class="src src-shell">wget http://repo.mysql.com/mysql-community-release-el7-5.noarch.rpm
rpm -ivh mysql-community-release-el7-5.noarch.rpm
yum update
yum install mysql-server
</pre>
</div>

<p>
初始化 MySQL：
</p>

<div class="org-src-container">
<pre class="src src-shell">mysqld --initialize
</pre>
</div>

<p>
启动 MySQL：
</p>

<div class="org-src-container">
<pre class="src src-shell">systemctl start mysqld
</pre>
</div>

<p>
查看 MySQL 运行状态：
</p>

<div class="org-src-container">
<pre class="src src-shell">systemctl status mysqld
</pre>
</div>

<p>
验证 MySQL 安装
</p>

<p>
在成功安装 MySQL 后，一些基础表会表初始化，在服务器启动后，你可以通过简单的测试来验证 MySQL 是否工作正常。
</p>

<p>
使用 mysqladmin 工具来获取服务器状态：
</p>

<p>
使用 mysqladmin 命令俩检查服务器的版本, 在 linux 上该二进制文件位于 /usr/bin 目录，在 Windows 上该二进制文件位于 C:\mysql\bin。
</p>

<div class="org-src-container">
<pre class="src src-shell">mysql --version
mysqladmin --version
</pre>
</div>

<p>
使用 MySQL Client(Mysql 客户端) 执行简单的 SQL 命令
</p>

<p>
你可以在 MySQL Client(Mysql 客户端) 使用 mysql 命令连接到 MySQL 服务器上，默认情况下 MySQL 服务器的登录密码为空，所以本实例不需要输入密码。
</p>

<p>
命令如下：
</p>

<div class="org-src-container">
<pre class="src src-shell">mysql
</pre>
</div>

<p>
Mysql 安装后需要做的
</p>

<p>
Mysql 安装成功后，默认的 root 用户密码为空，你可以使用以下命令来创建 root 用户的密码：
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #4f97d7;">[</span>root@host<span style="color: #4f97d7;">]</span># mysqladmin -u root password <span style="color: #2d9574;">"new_password"</span>;
</pre>
</div>

<p>
现在你可以通过以下命令来连接到 Mysql 服务器：
</p>

<div class="org-src-container">
<pre class="src src-shell">mysql -u root -p
</pre>
</div>
</div>
</div>
