_org/_posts/db/2018-10-15-mysql.org
* CentOS7 下安装 MySQL 完整示例

#+begin_src shell
# 安装前看是否安装过 mysql，
yum list installed mysql*
# 如果有就用 yum remove 卸载 mysql
# 查看 yum 库下是否有 mysql-server
yum list | grep mysql 或 yum -y list mysql*
# 如果没有（一般在 centos7 下没有）
wget http://repo.mysql.com/mysql80-community-release-el7-1.noarch.rpm
sudo rpm -ivh mysql80-community-release-el7-1.noarch.rpm

# 然后安装 mysql
sudo yum install mysql-server
sudo yum install mysql-devel

# 如果有 mysql-server，则按下面步骤
# 安装 mysql 客户端：
sudo yum install mysql
# 安装 mysql 服务器端：
sudo yum install mysql-server
sudo yum install mysql-devel

# 修改配置
# file: /etc/my.cnf
[mysqld]
character-set-server=utf8mb4

# 然后启动 mysql 服务，可能需要输入 root 密码
service mysqld start
# 登录 mysql
mysql -u root -p
# 刚安装密码为空，直接按回车
# 如果提示权限错误，是第一次启动后生成的随机密码，可使用下列命令查看
grep "temporary password" /var/log/mysqld.log

# 查看数据库：
show databases;
# 如果提示错误
# ===> ERROR 1820 (HY000): You must reset your password
# ===> using ALTER USER statement before executing this statement.
# 可以使用如下两种方式修改密码：
# 1.
SET PASSWORD = PASSWORD(‘12345678’);
# 2.
ALTER USER USER() IDENTIFIED BY ‘12345678’;
# ===> ERROR 1819 (HY000): Your password does not satisfy the current policy requirements
# 出现这个错其实是和 validate_password_policy 的值有关。
# MySQL 完整的初始密码规则可以通过如下命令查看：
use sys;
SHOW VARIABLES LIKE 'validate_password%';
# validate_password_policy 默认是 1，即 MEDIUM，所以刚开始设置的密码必须符合长度，
# 且必须含有数字，小写或大写字母，特殊字符。
# 有时候，只是为了自己测试，不想密码设置得那么复杂，
# 譬如说，我只想设置 root 的密码为 123456。
# 必须修改两个全局参数：
set global validate_password_policy=0;
# 这样，判断密码的标准就基于密码的长度了。
# 这个由 validate_password_length 参数来决定。
# 密码的长度是由 validate_password_length 决定的，
# 而 validate_password_length 的计算公式是：
# validate_password_length = validate_password_number_count +
#     validate_password_special_char_count +
#     (2 * validate_password_mixed_case_count)
# validate_password_number_count 指定了密码中数据的长度
# validate_password_special_char_count 指定了密码中特殊字符的长度
# validate_password_mixed_case_count 指定了密码中大小字母的长度。
set global validate_password_length=1;
# 这些参数，默认值均为 1，所以 validate_password_length 最小值为 4，
# 如果你显性指定 validate_password_length 的值小于 4，
# 尽管不会报错，但 validate_password_length 的值将设为 4。
# 刷新系统并使用新密码测试登录
flush privileges;
mysql -u root -p
# 因为安装了 Yum Repository，以后每次 yum 操作都会自动更新，可以卸载：
sudo yum -y remove mysql80-community-release-el7-1.noarch.rpm
#+end_src

* 启动及关闭 MySQL 服务器

** Windows 系统下

在 Windows 系统下，打开命令窗口(cmd)，进入 MySQL 安装目录的 bin 目录。

启动：

#+begin_src shell
cd c:/mysql/bin
mysqld --console
#+end_src

关闭：

#+begin_src shell
cd c:/mysql/bin
mysqladmin -uroot shutdown
#+end_src

