_posts/db/2018-10-15-mysql.html

<div id="outline-container-org6702747" class="outline-2">
<h2 id="org6702747"><span class="section-number-2">2</span> CentOS7 下安装 MySQL 完整示例</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#23433;&#35013;&#21069;&#30475;&#26159;&#21542;&#23433;&#35013;&#36807; mysql&#65292;</span>
yum list installed mysql*
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#22914;&#26524;&#26377;&#23601;&#29992; yum remove &#21368;&#36733; mysql</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#26597;&#30475; yum &#24211;&#19979;&#26159;&#21542;&#26377; mysql-server</span>
yum list | grep mysql &#25110; yum -y list mysql*
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#22914;&#26524;&#27809;&#26377;&#65288;&#19968;&#33324;&#22312; centos7 &#19979;&#27809;&#26377;&#65289;</span>
wget http://repo.mysql.com/mysql80-community-release-el7-1.noarch.rpm
sudo rpm -ivh mysql80-community-release-el7-1.noarch.rpm

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#28982;&#21518;&#23433;&#35013; mysql</span>
sudo yum install mysql-server
sudo yum install mysql-devel

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#22914;&#26524;&#26377; mysql-server&#65292;&#21017;&#25353;&#19979;&#38754;&#27493;&#39588;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#23433;&#35013; mysql &#23458;&#25143;&#31471;&#65306;</span>
sudo yum install mysql
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#23433;&#35013; mysql &#26381;&#21153;&#22120;&#31471;&#65306;</span>
sudo yum install mysql-server
sudo yum install mysql-devel

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#20462;&#25913;&#37197;&#32622;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">file: /etc/my.cnf</span>
<span style="color: #4f97d7;">[</span>mysqld<span style="color: #4f97d7;">]</span>
character-set-server=utf8mb4

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#28982;&#21518;&#21551;&#21160; mysql &#26381;&#21153;&#65292;&#21487;&#33021;&#38656;&#35201;&#36755;&#20837; root &#23494;&#30721;</span>
service mysqld start
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#30331;&#24405; mysql</span>
mysql -u root -p
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#21018;&#23433;&#35013;&#23494;&#30721;&#20026;&#31354;&#65292;&#30452;&#25509;&#25353;&#22238;&#36710;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#22914;&#26524;&#25552;&#31034;&#26435;&#38480;&#38169;&#35823;&#65292;&#26159;&#31532;&#19968;&#27425;&#21551;&#21160;&#21518;&#29983;&#25104;&#30340;&#38543;&#26426;&#23494;&#30721;&#65292;&#21487;&#20351;&#29992;&#19979;&#21015;&#21629;&#20196;&#26597;&#30475;</span>
grep <span style="color: #2d9574;">"temporary password"</span> /var/log/mysqld.log

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#26597;&#30475;&#25968;&#25454;&#24211;&#65306;</span>
show databases;
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#22914;&#26524;&#25552;&#31034;&#38169;&#35823;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">===&gt; ERROR 1820 (HY000): You must reset your password</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">===&gt; using ALTER USER statement before executing this statement.</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#21487;&#20197;&#20351;&#29992;&#22914;&#19979;&#20004;&#31181;&#26041;&#24335;&#20462;&#25913;&#23494;&#30721;&#65306;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">1.</span>
SET <span style="color: #7590db;">PASSWORD</span> = PASSWORD<span style="color: #4f97d7;">(</span>&#8216;<span style="color: #a45bad;">12345678</span>&#8217;<span style="color: #4f97d7;">)</span>;
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">2.</span>
ALTER USER USER<span style="color: #4f97d7;">()</span> IDENTIFIED BY &#8216;<span style="color: #a45bad;">12345678</span>&#8217;;
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">===&gt; ERROR 1819 (HY000): Your password does not satisfy the current policy requirements</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#20986;&#29616;&#36825;&#20010;&#38169;&#20854;&#23454;&#26159;&#21644; validate_password_policy &#30340;&#20540;&#26377;&#20851;&#12290;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">MySQL &#23436;&#25972;&#30340;&#21021;&#22987;&#23494;&#30721;&#35268;&#21017;&#21487;&#20197;&#36890;&#36807;&#22914;&#19979;&#21629;&#20196;&#26597;&#30475;&#65306;</span>
use sys;
SHOW VARIABLES LIKE <span style="color: #2d9574;">'validate_password%'</span>;
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">validate_password_policy &#40664;&#35748;&#26159; 1&#65292;&#21363; MEDIUM&#65292;&#25152;&#20197;&#21018;&#24320;&#22987;&#35774;&#32622;&#30340;&#23494;&#30721;&#24517;&#39035;&#31526;&#21512;&#38271;&#24230;&#65292;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#19988;&#24517;&#39035;&#21547;&#26377;&#25968;&#23383;&#65292;&#23567;&#20889;&#25110;&#22823;&#20889;&#23383;&#27597;&#65292;&#29305;&#27530;&#23383;&#31526;&#12290;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#26377;&#26102;&#20505;&#65292;&#21482;&#26159;&#20026;&#20102;&#33258;&#24049;&#27979;&#35797;&#65292;&#19981;&#24819;&#23494;&#30721;&#35774;&#32622;&#24471;&#37027;&#20040;&#22797;&#26434;&#65292;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#35692;&#22914;&#35828;&#65292;&#25105;&#21482;&#24819;&#35774;&#32622; root &#30340;&#23494;&#30721;&#20026; 123456&#12290;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#24517;&#39035;&#20462;&#25913;&#20004;&#20010;&#20840;&#23616;&#21442;&#25968;&#65306;</span>
<span style="color: #4f97d7;">set</span> global <span style="color: #7590db;">validate_password_policy</span>=<span style="color: #a45bad;">0</span>;
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#36825;&#26679;&#65292;&#21028;&#26029;&#23494;&#30721;&#30340;&#26631;&#20934;&#23601;&#22522;&#20110;&#23494;&#30721;&#30340;&#38271;&#24230;&#20102;&#12290;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#36825;&#20010;&#30001; validate_password_length &#21442;&#25968;&#26469;&#20915;&#23450;&#12290;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#23494;&#30721;&#30340;&#38271;&#24230;&#26159;&#30001; validate_password_length &#20915;&#23450;&#30340;&#65292;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#32780; validate_password_length &#30340;&#35745;&#31639;&#20844;&#24335;&#26159;&#65306;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">validate_password_length = validate_password_number_count +</span>
<span style="color: #2aa1ae; background-color: #292e34;">#     </span><span style="color: #2aa1ae; background-color: #292e34;">validate_password_special_char_count +</span>
<span style="color: #2aa1ae; background-color: #292e34;">#     </span><span style="color: #2aa1ae; background-color: #292e34;">(2 * validate_password_mixed_case_count)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">validate_password_number_count &#25351;&#23450;&#20102;&#23494;&#30721;&#20013;&#25968;&#25454;&#30340;&#38271;&#24230;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">validate_password_special_char_count &#25351;&#23450;&#20102;&#23494;&#30721;&#20013;&#29305;&#27530;&#23383;&#31526;&#30340;&#38271;&#24230;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">validate_password_mixed_case_count &#25351;&#23450;&#20102;&#23494;&#30721;&#20013;&#22823;&#23567;&#23383;&#27597;&#30340;&#38271;&#24230;&#12290;</span>
<span style="color: #4f97d7;">set</span> global <span style="color: #7590db;">validate_password_length</span>=<span style="color: #a45bad;">1</span>;
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#36825;&#20123;&#21442;&#25968;&#65292;&#40664;&#35748;&#20540;&#22343;&#20026; 1&#65292;&#25152;&#20197; validate_password_length &#26368;&#23567;&#20540;&#20026; 4&#65292;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#22914;&#26524;&#20320;&#26174;&#24615;&#25351;&#23450; validate_password_length &#30340;&#20540;&#23567;&#20110; 4&#65292;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#23613;&#31649;&#19981;&#20250;&#25253;&#38169;&#65292;&#20294; validate_password_length &#30340;&#20540;&#23558;&#35774;&#20026; 4&#12290;</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#21047;&#26032;&#31995;&#32479;&#24182;&#20351;&#29992;&#26032;&#23494;&#30721;&#27979;&#35797;&#30331;&#24405;</span>
flush privileges;
mysql -u root -p
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#22240;&#20026;&#23433;&#35013;&#20102; Yum Repository&#65292;&#20197;&#21518;&#27599;&#27425; yum &#25805;&#20316;&#37117;&#20250;&#33258;&#21160;&#26356;&#26032;&#65292;&#21487;&#20197;&#21368;&#36733;&#65306;</span>
sudo yum -y remove mysql80-community-release-el7-1.noarch.rpm
</pre>
</div>
</div>
</div>

<div id="outline-container-org287f712" class="outline-2">
<h2 id="org287f712"><span class="section-number-2">3</span> 启动及关闭 MySQL 服务器</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org9ad691a" class="outline-3">
<h3 id="org9ad691a"><span class="section-number-3">3.1</span> Windows 系统下</h3>
<div class="outline-text-3" id="text-3-1">
<p>
在 Windows 系统下，打开命令窗口(cmd)，进入 MySQL 安装目录的 bin 目录。
</p>

<p>
启动：
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #4f97d7;">cd</span> c:/mysql/bin
mysqld --console
</pre>
</div>

<p>
关闭：
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #4f97d7;">cd</span> c:/mysql/bin
mysqladmin -uroot shutdown
</pre>
</div>
</div>
</div>
