_org/_posts/db/2018-10-15-mysql.org
** Linux 系统下

首先，我们需要通过以下命令来检查 MySQL 服务器是否启动：

#+begin_src shell
ps -ef | grep mysqld
#+end_src

如果 MySql 已经启动，以上命令将输出 mysql 进程列表， 如果 mysql 未启动，你可以使用以下命令来启动 mysql 服务器:

#+begin_src shell
./mysqld_safe &
#+end_src

如果你想关闭目前运行的 MySQL 服务器, 你可以执行以下命令:

#+begin_src shell
./mysqladmin -u root -p shutdown
#+end_src

** 打开客户端

#+begin_src shell
mysql -u root -p
#+end_src

* 用户设置

如果你需要添加 MySQL 用户，你只需要在 mysql 数据库中的 user 表添加新用户即可。

以下为添加用户的的实例，用户名为 guest，密码为 guest123，并授权用户可进行 SELECT, INSERT 和 UPDATE 操作权限：

#+begin_src sql
use mysql;
INSERT INTO user (host, user, password, select_priv, insert_priv, update_priv)
           VALUES ('localhost', 'guest', PASSWORD('guest123'), 'Y', 'Y', 'Y');
FLUSH PRIVILEGES;
SELECT host, user, password FROM user WHERE user = 'guest';
#+end_src

在添加用户时，请注意使用 MySQL 提供的 PASSWORD() 函数来对密码进行加密。 你可以在以上实例看到用户密码加密后为：6f8c114b58f2ce9e.

注意：

- 在 MySQL5.7 中 user 表的 password 已换成了 authentication_string。
- password() 加密函数已经在 8.0.11 中移除了，可以使用 MD5() 函数代替。
- 在注意需要执行 FLUSH PRIVILEGES 语句。 这个命令执行后会重新载入授权表。 如果你不使用该命令，你就无法使用新创建的用户来连接 mysql 服务器，除非你重启 mysql 服务器。

#+begin_src sql
use mysql;
INSERT INTO user (host, user, authentication_string, select_priv, insert_priv, update_priv)
           VALUES ('localhost', 'guest', MD5('guest123'), 'Y', 'Y', 'Y');
FLUSH PRIVILEGES;
SELECT host, user, authentication_string FROM user WHERE user = 'guest';
#+end_src

你可以在创建用户时，为用户指定权限，在对应的权限列中，在插入语句中设置为 'Y' 即可，用户权限列表如下：

#+begin_src text
Select_priv
Insert_priv
Update_priv
Delete_priv
Create_priv
Drop_priv
Reload_priv
Shutdown_priv
Process_priv
File_priv
Grant_priv
References_priv
Index_priv
Alter_priv
#+end_src

另外一种添加用户的方法为通过 SQL 的 GRANT 命令，以下命令会给指定数据库 TUTORIALS 添加用户 zara，密码为 zara123。

#+begin_src sql
use mysql;
GRANT SELECT,INSERT,UPDATE,DELETE,CREATE,DROP
    -> ON TUTORIALS.*
    -> TO 'zara'@'localhost'
    -> IDENTIFIED BY 'zara123';
#+end_src

以上命令会在 mysql 数据库中的 user 表创建一条用户信息记录。

注意: MySQL 的 SQL 语句以分号 (;) 作为结束标识。

* MySQL 8.0 用户管理

#+begin_src sql
# 创建账号密码
create user `wangwei`@`127.0.0.1` identified by 'passowrd';
# 授予所有权限
grant all on *.* to `wangwei`@`127.0.0.1` with grant option;
# 授予某个数据库所有权限
grant all on databasename.tablename to `wangwei`@`127.0.0.1` with grant option;
# 删除权限
revoke all privileges on databasename.tablename from 'username'@'host';
# 修改密码
alter user 'root'@'localhost' identified with mysql_native_password by '你的密码';
alter user 'mydev'@'localhost' identified by 'MyDev123$';
# 查看用户权限
show grants for 'mydev'@'localhost';
#+end_src

** MySQL 8.0 中带过期时间用户的创建：

#+begin_src sql
CREATE USER `wangwei`@`127.0.0.1` IDENTIFIED BY 'wangwei' PASSWORD EXPIRE INTERVAL 90 DAY;
GRANT ALL ON *.* TO `wangwei`@`127.0.0.1` WITH GRANT OPTION;
#+end_src

** MySQL 8.0 修改用户密码：

