_posts/db/2018-10-15-mysql.html

<div id="outline-container-orgd9ae254" class="outline-3">
<h3 id="orgd9ae254"><span class="section-number-3">3.2</span> Linux 系统下</h3>
<div class="outline-text-3" id="text-3-2">
<p>
首先，我们需要通过以下命令来检查 MySQL 服务器是否启动：
</p>

<div class="org-src-container">
<pre class="src src-shell">ps -ef | grep mysqld
</pre>
</div>

<p>
如果 MySql 已经启动，以上命令将输出 mysql 进程列表， 如果 mysql 未启动，你可以使用以下命令来启动 mysql 服务器:
</p>

<div class="org-src-container">
<pre class="src src-shell">./mysqld_safe &amp;
</pre>
</div>

<p>
如果你想关闭目前运行的 MySQL 服务器, 你可以执行以下命令:
</p>

<div class="org-src-container">
<pre class="src src-shell">./mysqladmin -u root -p shutdown
</pre>
</div>
</div>
</div>

<div id="outline-container-org0d483d2" class="outline-3">
<h3 id="org0d483d2"><span class="section-number-3">3.3</span> 打开客户端</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-shell">mysql -u root -p
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3d15bca" class="outline-2">
<h2 id="org3d15bca"><span class="section-number-2">4</span> 用户设置</h2>
<div class="outline-text-2" id="text-4">
<p>
如果你需要添加 MySQL 用户，你只需要在 mysql 数据库中的 user 表添加新用户即可。
</p>

<p>
以下为添加用户的的实例，用户名为 guest，密码为 guest123，并授权用户可进行 SELECT, INSERT 和 UPDATE 操作权限：
</p>

<div class="org-src-container">
<pre class="src src-sql">use mysql;
<span style="color: #4f97d7; font-weight: bold;">INSERT</span> <span style="color: #4f97d7; font-weight: bold;">INTO</span> <span style="color: #4f97d7;">user</span> <span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">host</span>, <span style="color: #4f97d7;">user</span>, password, select_priv, insert_priv, update_priv<span style="color: #4f97d7;">)</span>
           <span style="color: #4f97d7; font-weight: bold;">VALUES</span> <span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'localhost'</span>, <span style="color: #2d9574;">'guest'</span>, PASSWORD<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">'guest123'</span><span style="color: #bc6ec5;">)</span>, <span style="color: #2d9574;">'Y'</span>, <span style="color: #2d9574;">'Y'</span>, <span style="color: #2d9574;">'Y'</span><span style="color: #4f97d7;">)</span>;
FLUSH <span style="color: #4f97d7; font-weight: bold;">PRIVILEGES</span>;
<span style="color: #4f97d7; font-weight: bold;">SELECT</span> <span style="color: #4f97d7; font-weight: bold;">host</span>, <span style="color: #4f97d7;">user</span>, password <span style="color: #4f97d7; font-weight: bold;">FROM</span> <span style="color: #4f97d7;">user</span> <span style="color: #4f97d7; font-weight: bold;">WHERE</span> <span style="color: #4f97d7;">user</span> = <span style="color: #2d9574;">'guest'</span>;
</pre>
</div>

<p>
在添加用户时，请注意使用 MySQL 提供的 PASSWORD() 函数来对密码进行加密。 你可以在以上实例看到用户密码加密后为：6f8c114b58f2ce9e.
</p>

<p>
注意：
</p>

<ul class="org-ul">
<li>在 MySQL5.7 中 user 表的 password 已换成了 authentication_string。</li>
<li>password() 加密函数已经在 8.0.11 中移除了，可以使用 MD5() 函数代替。</li>
<li>在注意需要执行 FLUSH PRIVILEGES 语句。 这个命令执行后会重新载入授权表。 如果你不使用该命令，你就无法使用新创建的用户来连接 mysql 服务器，除非你重启 mysql 服务器。</li>
</ul>

<div class="org-src-container">
<pre class="src src-sql">use mysql;
<span style="color: #4f97d7; font-weight: bold;">INSERT</span> <span style="color: #4f97d7; font-weight: bold;">INTO</span> <span style="color: #4f97d7;">user</span> <span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">host</span>, <span style="color: #4f97d7;">user</span>, authentication_string, select_priv, insert_priv, update_priv<span style="color: #4f97d7;">)</span>
           <span style="color: #4f97d7; font-weight: bold;">VALUES</span> <span style="color: #4f97d7;">(</span><span style="color: #2d9574;">'localhost'</span>, <span style="color: #2d9574;">'guest'</span>, MD5<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">'guest123'</span><span style="color: #bc6ec5;">)</span>, <span style="color: #2d9574;">'Y'</span>, <span style="color: #2d9574;">'Y'</span>, <span style="color: #2d9574;">'Y'</span><span style="color: #4f97d7;">)</span>;
FLUSH <span style="color: #4f97d7; font-weight: bold;">PRIVILEGES</span>;
<span style="color: #4f97d7; font-weight: bold;">SELECT</span> <span style="color: #4f97d7; font-weight: bold;">host</span>, <span style="color: #4f97d7;">user</span>, authentication_string <span style="color: #4f97d7; font-weight: bold;">FROM</span> <span style="color: #4f97d7;">user</span> <span style="color: #4f97d7; font-weight: bold;">WHERE</span> <span style="color: #4f97d7;">user</span> = <span style="color: #2d9574;">'guest'</span>;
</pre>
</div>

<p>
你可以在创建用户时，为用户指定权限，在对应的权限列中，在插入语句中设置为 'Y' 即可，用户权限列表如下：
</p>

<div class="org-src-container">
<pre class="src src-text">Select_priv
Insert_priv
Update_priv
Delete_priv
Create_priv
Drop_priv
Reload_priv
Shutdown_priv
Process_priv
File_priv
Grant_priv
References_priv
Index_priv
Alter_priv
</pre>
</div>

<p>
另外一种添加用户的方法为通过 SQL 的 GRANT 命令，以下命令会给指定数据库 TUTORIALS 添加用户 zara，密码为 zara123。
</p>

<div class="org-src-container">
<pre class="src src-sql">use mysql;
<span style="color: #4f97d7; font-weight: bold;">GRANT</span> <span style="color: #4f97d7; font-weight: bold;">SELECT</span>,<span style="color: #4f97d7; font-weight: bold;">INSERT</span>,<span style="color: #4f97d7; font-weight: bold;">UPDATE</span>,<span style="color: #4f97d7; font-weight: bold;">DELETE</span>,<span style="color: #4f97d7; font-weight: bold;">CREATE</span>,<span style="color: #4f97d7; font-weight: bold;">DROP</span>
    -&gt; <span style="color: #4f97d7; font-weight: bold;">ON</span> TUTORIALS.*
    -&gt; <span style="color: #4f97d7; font-weight: bold;">TO</span> <span style="color: #2d9574;">'zara'</span>@<span style="color: #2d9574;">'localhost'</span>
    -&gt; IDENTIFIED <span style="color: #4f97d7; font-weight: bold;">BY</span> <span style="color: #2d9574;">'zara123'</span>;
</pre>
</div>

<p>
以上命令会在 mysql 数据库中的 user 表创建一条用户信息记录。
</p>

<p>
注意: MySQL 的 SQL 语句以分号 (;) 作为结束标识。
</p>
</div>
</div>

<div id="outline-container-org2859b92" class="outline-2">
<h2 id="org2859b92"><span class="section-number-2">5</span> MySQL 8.0 用户管理</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-sql"># &#21019;&#24314;&#36134;&#21495;&#23494;&#30721;
<span style="color: #4f97d7; font-weight: bold;">create</span> <span style="color: #4f97d7;">user</span> `wangwei`@`<span style="color: #a45bad;">127</span>.<span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">1</span>` identified <span style="color: #4f97d7; font-weight: bold;">by</span> <span style="color: #2d9574;">'passowrd'</span>;
# &#25480;&#20104;&#25152;&#26377;&#26435;&#38480;
<span style="color: #4f97d7; font-weight: bold;">grant</span> <span style="color: #4f97d7; font-weight: bold;">all</span> <span style="color: #4f97d7; font-weight: bold;">on</span> *.* <span style="color: #4f97d7; font-weight: bold;">to</span> `wangwei`@`<span style="color: #a45bad;">127</span>.<span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">1</span>` <span style="color: #4f97d7; font-weight: bold;">with</span> <span style="color: #4f97d7; font-weight: bold;">grant</span> <span style="color: #4f97d7; font-weight: bold;">option</span>;
# &#25480;&#20104;&#26576;&#20010;&#25968;&#25454;&#24211;&#25152;&#26377;&#26435;&#38480;
<span style="color: #4f97d7; font-weight: bold;">grant</span> <span style="color: #4f97d7; font-weight: bold;">all</span> <span style="color: #4f97d7; font-weight: bold;">on</span> databasename.tablename <span style="color: #4f97d7; font-weight: bold;">to</span> `wangwei`@`<span style="color: #a45bad;">127</span>.<span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">1</span>` <span style="color: #4f97d7; font-weight: bold;">with</span> <span style="color: #4f97d7; font-weight: bold;">grant</span> <span style="color: #4f97d7; font-weight: bold;">option</span>;
# &#21024;&#38500;&#26435;&#38480;
<span style="color: #4f97d7; font-weight: bold;">revoke</span> <span style="color: #4f97d7; font-weight: bold;">all</span> <span style="color: #4f97d7; font-weight: bold;">privileges</span> <span style="color: #4f97d7; font-weight: bold;">on</span> databasename.tablename <span style="color: #4f97d7; font-weight: bold;">from</span> <span style="color: #2d9574;">'username'</span>@<span style="color: #2d9574;">'host'</span>;
# &#20462;&#25913;&#23494;&#30721;
<span style="color: #4f97d7; font-weight: bold;">alter</span> <span style="color: #4f97d7;">user</span> <span style="color: #2d9574;">'root'</span>@<span style="color: #2d9574;">'localhost'</span> identified <span style="color: #4f97d7; font-weight: bold;">with</span> mysql_native_password <span style="color: #4f97d7; font-weight: bold;">by</span> <span style="color: #2d9574;">'&#20320;&#30340;&#23494;&#30721;'</span>;
<span style="color: #4f97d7; font-weight: bold;">alter</span> <span style="color: #4f97d7;">user</span> <span style="color: #2d9574;">'mydev'</span>@<span style="color: #2d9574;">'localhost'</span> identified <span style="color: #4f97d7; font-weight: bold;">by</span> <span style="color: #2d9574;">'MyDev123$'</span>;
# &#26597;&#30475;&#29992;&#25143;&#26435;&#38480;
show grants <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #2d9574;">'mydev'</span>@<span style="color: #2d9574;">'localhost'</span>;
</pre>
</div>
</div>

<div id="outline-container-org4e2707f" class="outline-3">
<h3 id="org4e2707f"><span class="section-number-3">5.1</span> MySQL 8.0 中带过期时间用户的创建：</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #4f97d7; font-weight: bold;">CREATE</span> <span style="color: #4f97d7;">USER</span> `wangwei`@`<span style="color: #a45bad;">127</span>.<span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">1</span>` IDENTIFIED <span style="color: #4f97d7; font-weight: bold;">BY</span> <span style="color: #2d9574;">'wangwei'</span> PASSWORD EXPIRE <span style="color: #ce537a; font-weight: bold;">INTERVAL</span> <span style="color: #a45bad;">90</span> <span style="color: #4f97d7; font-weight: bold;">DAY</span>;
<span style="color: #4f97d7; font-weight: bold;">GRANT</span> <span style="color: #4f97d7; font-weight: bold;">ALL</span> <span style="color: #4f97d7; font-weight: bold;">ON</span> *.* <span style="color: #4f97d7; font-weight: bold;">TO</span> `wangwei`@`<span style="color: #a45bad;">127</span>.<span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">1</span>` <span style="color: #4f97d7; font-weight: bold;">WITH</span> <span style="color: #4f97d7; font-weight: bold;">GRANT</span> <span style="color: #4f97d7; font-weight: bold;">OPTION</span>;
</pre>
</div>
</div>
</div>
