_org/_posts/db/2018-10-15-mysql.org
*** 密码过期时间管理

要全局建立自动密码到期策略，请使用 default_password_lifetime 系统变量。其默认值为 0，禁用自动密码过期。

如果值 default_password_lifetime 正整数 N，则表示允许的密码生存期，以便密码必须每天更改 N。可以加在配置文件中：

1. 要建立全局策略，密码的使用期限大约为六个月，请在服务器 my.cnf 文件中使用以下行启动服务器：

#+begin_src sql
[mysqld]default_password_lifetime=180
#+end_src

2. 要建立全局策略，以便密码永不过期，请将其设置 default_password_lifetime 为 0：

#+begin_src sql
[mysqld]default_password_lifetime=0
#+end_src

这个参数是可以动态设置并保存的：

#+begin_src sql
SET PERSIST default_password_lifetime = 180;SET PERSIST default_password_lifetime = 0;
#+end_src

创建和修改带有密码过期的用户，帐户特定的到期时间设置示例：

要求每 90 天更换密码：

#+begin_src sql
CREATE USER 'wangwei'@'localhost' PASSWORD EXPIRE INTERVAL 90 DAY;
ALTER USER 'wangwei'@'localhost' PASSWORD EXPIRE INTERVAL 90 DAY;
#+end_src

禁用密码过期：

#+begin_src sql
CREATE USER ' wangwei'@'localhost' PASSWORD EXPIRE NEVER;
ALTER USER 'wangwei'@'localhost' PASSWORD EXPIRE NEVER;
#+end_src

遵循全局到期政策：

#+begin_src sql
CREATE USER 'wangwei'@'localhost' PASSWORD EXPIRE DEFAULT;
ALTER USER 'wangwei'@'localhost' PASSWORD EXPIRE DEFAULT;1.3 MySQL 用户密码重用策略设置
#+end_src

MySQL 允许限制重复使用以前的密码。可以根据密码更改次数、已用时间或两者来建立重用限制。帐户的密码历史由过去分配的密码组成。

MySQL 可以限制从此历史记录中选择新密码：

1. 如果根据密码更改次数限制帐户，则无法从指定数量的最新密码中选择新密码。例如，如果密码更改的最小数量设置为 3，则新密码不能与任何最近的 3 个密码相同。

2. 如果帐户因时间的限制而被限制，则无法从历史记录中的新密码中选择新密码，该新密码不会超过指定的天数。例如，如果密码重用间隔设置为 60，则新密码不得在最近 60 天内选择的密码之间。

注意：空密码不记录在密码历史记录中，并随时可以重复使用。

要全局建立密码重用策略，请使用 password_history 和 password_reuse_interval 系统变量。要在服务器启动时指定变量值，请在服务器 my.cnf 文件中定义它们。

示例：

要禁止重复使用最近 6 个密码或密码超过 365 天的任何密码，请将这些行放入您的服务器 my.cnf 文件中：

#+begin_src sql
[mysqld]password_history=6password_reuse_interval=365
#+end_src

要动态设置和保存配置，请使用如下所示的语句：

#+begin_src sql
SET PERSIST password_history = 6;
SET PERSIST password_reuse_interval = 365;
#+end_src

** MySQL8.0 的角色管理

MySQL 角色是指定的权限集合。像用户帐户一样，角色可以拥有授予和撤消的权限。

可以授予用户帐户角色，授予该帐户与每个角色相关的权限。用户被授予角色权限，则该用户拥有该角色的权限。

以下列表总结了 MySQL 提供的角色管理功能：

- CREATE ROLE 并 DROP ROLE 角色创建和删除；
- GRANT 并 REVOKE 为用户和角色分配和撤销权限；
- SHOW GRANTS 显示用户和角色的权限和角色分配；
- SET DEFAULT ROLE 指定哪些帐户角色默认处于活动状态；
- SET ROLE 更改当前会话中的活动角色。
- CURRENT_ROLE()功能显示当前会话中的活动角色。

*** 创建角色并授予用户角色权限

考虑如下几种场景：

- 应用程序使用名为 app_db 的数据库 。
- 与应用程序相关联，可以为创建和维护应用程序的开发人员以及管理员账户。
- 开发人员需要完全访问数据库。有的用户只需要读取权限，有的用户需要读取/写入权限。
- 为清楚区分角色的权限，将角色创建为所需权限集的名称。通过授权适当的角色，可以轻松地为用户帐户授予所需的权限。

要创建角色，请使用 CREATE ROLE：

#+begin_src sql
CREATE ROLE 'app_developer', 'app_read', 'app_write';
#+end_src

角色名称与用户帐户名称非常相似，由格式中的用户部分和主机部分组成。主机部分，如果省略，则默认为%。用户和主机部分可以不加引号，除非它们包含特殊字符。与帐户名称不同，角色名称的用户部分不能为空。为角色分配权限，使用与为用户分配权限相同的语法执行：

#+begin_src sql
GRANT ALL ON app_db.* TO 'app_developer';
GRANT SELECT ON app_db.* TO 'app_read';
GRANT INSERT, UPDATE, DELETE ON app_db.* TO 'app_write';
CREATE ROLE 'app_developer', 'app_read', 'app_write';
#+end_src

现在假设您最初需要一个开发人员帐户，两个需要只读访问权的用户以及一个需要读取/写入权限的用户。

使用 CREATEUSER 创建用户：

#+begin_src sql
CREATE USER 'dev1'@'localhost' IDENTIFIED BY 'dev1pass';
CREATE USER 'read_user1'@'localhost' IDENTIFIED BY 'read_user1pass';
CREATE USER 'read_user2'@'localhost' IDENTIFIED BY 'read_user2pass';
CREATE USER 'rw_user1'@'localhost' IDENTIFIED BY 'rw_user1pass';
#+end_src

要为每个用户分配其所需的权限，可以使用 GRANT 与刚才显示的形式相同的语句，但这需要列举每个用户的个人权限。

相反，使用 GRANT 允许授权角色而非权限的替代语法：

#+begin_src sql
GRANT 'app_developer' TO 'dev1'@'localhost';
GRANT 'app_read' TO 'read_user1'@'localhost', 'read_user2'@'localhost';
GRANT 'app_read', 'app_write' TO 'rw_user1'@'localhost';
#+end_src

结合角色所需的读取和写入权限，在 GRANT 中授权 rw_user1 用户读取和写入的角色。

在 GRANT 授权角色的语法和授权用户的语法不同：有一个 ON 来区分角色和用户的授权，有 ON 的为用户授权，而没有 ON 用来分配角色。

由于语法不同，因此不能在同一语句中混合分配用户权限和角色。（允许为用户分配权限和角色，但必须使用单独的 GRANT 语句，每种语句的语法都要与授权的内容相匹配。）

