_org/_posts/db/2018-10-15-mysql.org
*** 检查角色权限

要验证分配给用户的权限，使用 SHOW GRANTS。例如：

#+begin_src sql
SHOW GRANTS FOR 'dev1'@'localhost';
#+end_src

但是，它会显示每个授予的角色，而不会将其显示为角色所代表的权限。如果要显示角色权限，添加一个 USING 来显示：

#+begin_src sql
SHOW GRANTS FOR 'dev1'@'localhost' USING 'app_developer';
#+end_src

同样验证其他类型的用户：

#+begin_src sql
SHOW GRANTS FOR 'read_user1'@'localhost' USING 'app_read';
#+end_src

撤消角色或角色权限

正如可以授权某个用户的角色一样，可以从帐户中撤销这些角色：

#+begin_src sql
REVOKE role FROM user;
#+end_src

REVOKE 可以用于角色修改角色权限。这不仅影响角色本身权限，还影响任何授予该角色的用户权限。假设想临时让所有用户只读，使用 REVOKE 从该 app_write 角色中撤消修改权限 ：

#+begin_src sql
REVOKE INSERT, UPDATE, DELETE ON app_db.* FROM 'app_write';
#+end_src

碰巧，某个角色完全没有任何权限，正如可以看到的那样 SHOW GRANTS（这个语句可以和角色一起使用，而不仅仅是查询用户权限可用）：

#+begin_src sql
SHOW GRANTS FOR 'app_write';
#+end_src

从角色中撤销权限会影响到该角色中任何用户的权限，因此 rw_user1 现在已经没有表修改权限（INSERT，UPDATE，和 DELETE 权限已经没有了）：

#+begin_src sql
SHOW GRANTS FOR 'rw_user1'@'localhost' USING 'app_read', 'app_write';
#+end_src


实际上，rw_user1 读/写用户已成为只读用户。对于被授予 app_write 角色的任何其他用户也会发生这种情况，说明修改使用角色而不必修改个人帐户的权限。

要恢复角色的修改权限，只需重新授予它们即可：

#+begin_src sql
GRANT INSERT, UPDATE, DELETE ON app_db.* TO 'app_write';
#+end_src

现在 rw_user1 再次具有修改权限，就像授权该 app_write 角色的其他任何帐户一样。

删除角色

要删除角色，请使用 DROP ROLE：

#+begin_src sql
DROP ROLE 'app_read', 'app_write';
#+end_src

删除角色会从授权它的每个帐户中撤消该角色。

角色和用户在实际中的应用

假设遗留应用开发项目在 MySQL 中的角色出现之前开始，因此与该项目相关联的所有用户都是直接授予权限（而不是授予角色权限）。其中一个帐户是最初被授予权限的开发者用户，如下所示：

#+begin_src sql
CREATE USER 'old_app_dev'@'localhost' IDENTIFIED BY 'old_app_devpass';
GRANT ALL ON old_app.* TO 'old_app_dev'@'localhost';
#+end_src

如果此开发人员离开项目，则有必要将权限分配给其他用户，或者项目参与人增多，则可能需要多个用户。以下是解决该问题的一些方法：

不使用角色：更改帐户密码，以便原始开发人员不能使用它，并让新的开发人员使用该帐户：

#+begin_src sql
ALTER USER 'old_app_dev'@'localhost' IDENTIFIED BY 'new_password';
#+end_src

使用角色：锁定帐户以防止任何人使用它来连接服务器：

#+begin_src sql
ALTER USER 'old_app_dev'@'localhost' ACCOUNT LOCK;
#+end_src

然后将该帐户视为角色。对于每个新开发项目的开发者，创建一个新帐户并授予其原始开发者帐户：

CREATE USER 'new_app_dev1'@'localhost' IDENTIFIED BY 'new_password';
GRANT 'old_app_dev'@'localhost' TO 'new_app_dev1'@'localhost';

其效果是将原始开发者帐户权限分配给新帐户。

MySQL8.0 的用户和角色管理也越来越像 Oracle 了，8.0 中有不少新的特性，变化还是很大的，需要 DBA 不断的学习和测试，更新对 MySQL 新版的认知，更好地运维 MySQL 数据库。未来 MySQL 数据库自治和智能数据库是必然发展趋势，对 DBA 来说是解放，也是挑战。

* /etc/my.cnf 文件配置

一般情况下，你不需要修改该配置文件，该文件默认配置如下：

#+end_src ini
[mysqld]
datadir=/var/lib/mysql
socket=/var/lib/mysql/mysql.sock

[mysql.server]
user=mysql
basedir=/var/lib

[safe_mysqld]
err-log=/var/log/mysqld.log
pid-file=/var/run/mysqld/mysqld.pid
#+end_src

在配置文件中，你可以指定不同的错误日志文件存放的目录，一般你不需要改动这些配置。

* MySQL 常见命令

以下列出了使用 Mysql 数据库过程中常用的命令：

#+begin_src sql
USE 数据库名 :
# 选择要操作的 Mysql 数据库，使用该命令后所有 Mysql 命令都只针对该数据库。
SHOW DATABASES:
# 列出 MySQL 数据库管理系统的数据库列表。
SHOW TABLES:
# 显示指定数据库的所有表，使用该命令前需要使用 use 命令来选择要操作的数据库。
SHOW COLUMNS FROM 数据表:
# 显示数据表的属性，属性类型，主键信息 ，是否为 NULL，默认值等其他信息。
SHOW INDEX FROM 数据表:
# 显示数据表的详细索引信息，包括 PRIMARY KEY（主键）。
SHOW TABLE STATUS LIKE [FROM db_name] [LIKE 'pattern'] \G:
# 该命令将输出 Mysql 数据库管理系统的性能及统计信息。
#+end_src

数据库 CRUD

#+begin_src sql
# 显示数据库
show databases;
# 选择数据库
use dbname;
# 创建数据库
crate database dbname;
# 创建数据库
drop database dbname;
#+end_src

* References

> 本文是我的学习笔记，内容参考了网上资源，为了方便自己查询使用，做了一些修改整理。
> 笔记内容摘录于下列文章，相应权利归属原作者，如有未列出的或有不妥，请联系我立即增补或删除。

- <http://www.runoob.com/mysql/mysql-tutorial.html>
- <https://www.sohu.com/a/229885311_610509>
