_posts/db/2018-10-15-mysql.html

<div id="outline-container-orgcdfe12f" class="outline-4">
<h4 id="orgcdfe12f"><span class="section-number-4">5.3.2</span> 检查角色权限</h4>
<div class="outline-text-4" id="text-5-3-2">
<p>
要验证分配给用户的权限，使用 SHOW GRANTS。例如：
</p>

<div class="org-src-container">
<pre class="src src-sql">SHOW GRANTS <span style="color: #4f97d7; font-weight: bold;">FOR</span> <span style="color: #2d9574;">'dev1'</span>@<span style="color: #2d9574;">'localhost'</span>;
</pre>
</div>

<p>
但是，它会显示每个授予的角色，而不会将其显示为角色所代表的权限。如果要显示角色权限，添加一个 USING 来显示：
</p>

<div class="org-src-container">
<pre class="src src-sql">SHOW GRANTS <span style="color: #4f97d7; font-weight: bold;">FOR</span> <span style="color: #2d9574;">'dev1'</span>@<span style="color: #2d9574;">'localhost'</span> <span style="color: #4f97d7; font-weight: bold;">USING</span> <span style="color: #2d9574;">'app_developer'</span>;
</pre>
</div>

<p>
同样验证其他类型的用户：
</p>

<div class="org-src-container">
<pre class="src src-sql">SHOW GRANTS <span style="color: #4f97d7; font-weight: bold;">FOR</span> <span style="color: #2d9574;">'read_user1'</span>@<span style="color: #2d9574;">'localhost'</span> <span style="color: #4f97d7; font-weight: bold;">USING</span> <span style="color: #2d9574;">'app_read'</span>;
</pre>
</div>

<p>
撤消角色或角色权限
</p>

<p>
正如可以授权某个用户的角色一样，可以从帐户中撤销这些角色：
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #4f97d7; font-weight: bold;">REVOKE</span> <span style="color: #4f97d7; font-weight: bold;">role</span> <span style="color: #4f97d7; font-weight: bold;">FROM</span> <span style="color: #4f97d7;">user</span>;
</pre>
</div>

<p>
REVOKE 可以用于角色修改角色权限。这不仅影响角色本身权限，还影响任何授予该角色的用户权限。假设想临时让所有用户只读，使用 REVOKE 从该 app_write 角色中撤消修改权限 ：
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #4f97d7; font-weight: bold;">REVOKE</span> <span style="color: #4f97d7; font-weight: bold;">INSERT</span>, <span style="color: #4f97d7; font-weight: bold;">UPDATE</span>, <span style="color: #4f97d7; font-weight: bold;">DELETE</span> <span style="color: #4f97d7; font-weight: bold;">ON</span> app_db.* <span style="color: #4f97d7; font-weight: bold;">FROM</span> <span style="color: #2d9574;">'app_write'</span>;
</pre>
</div>

<p>
碰巧，某个角色完全没有任何权限，正如可以看到的那样 SHOW GRANTS（这个语句可以和角色一起使用，而不仅仅是查询用户权限可用）：
</p>

<div class="org-src-container">
<pre class="src src-sql">SHOW GRANTS <span style="color: #4f97d7; font-weight: bold;">FOR</span> <span style="color: #2d9574;">'app_write'</span>;
</pre>
</div>

<p>
从角色中撤销权限会影响到该角色中任何用户的权限，因此 rw_user1 现在已经没有表修改权限（INSERT，UPDATE，和 DELETE 权限已经没有了）：
</p>

<div class="org-src-container">
<pre class="src src-sql">SHOW GRANTS <span style="color: #4f97d7; font-weight: bold;">FOR</span> <span style="color: #2d9574;">'rw_user1'</span>@<span style="color: #2d9574;">'localhost'</span> <span style="color: #4f97d7; font-weight: bold;">USING</span> <span style="color: #2d9574;">'app_read'</span>, <span style="color: #2d9574;">'app_write'</span>;
</pre>
</div>


<p>
实际上，rw_user1 读/写用户已成为只读用户。对于被授予 app_write 角色的任何其他用户也会发生这种情况，说明修改使用角色而不必修改个人帐户的权限。
</p>

<p>
要恢复角色的修改权限，只需重新授予它们即可：
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #4f97d7; font-weight: bold;">GRANT</span> <span style="color: #4f97d7; font-weight: bold;">INSERT</span>, <span style="color: #4f97d7; font-weight: bold;">UPDATE</span>, <span style="color: #4f97d7; font-weight: bold;">DELETE</span> <span style="color: #4f97d7; font-weight: bold;">ON</span> app_db.* <span style="color: #4f97d7; font-weight: bold;">TO</span> <span style="color: #2d9574;">'app_write'</span>;
</pre>
</div>

<p>
现在 rw_user1 再次具有修改权限，就像授权该 app_write 角色的其他任何帐户一样。
</p>

<p>
删除角色
</p>

<p>
要删除角色，请使用 DROP ROLE：
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #4f97d7; font-weight: bold;">DROP</span> <span style="color: #4f97d7; font-weight: bold;">ROLE</span> <span style="color: #2d9574;">'app_read'</span>, <span style="color: #2d9574;">'app_write'</span>;
</pre>
</div>

<p>
删除角色会从授权它的每个帐户中撤消该角色。
</p>

<p>
角色和用户在实际中的应用
</p>

<p>
假设遗留应用开发项目在 MySQL 中的角色出现之前开始，因此与该项目相关联的所有用户都是直接授予权限（而不是授予角色权限）。其中一个帐户是最初被授予权限的开发者用户，如下所示：
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #4f97d7; font-weight: bold;">CREATE</span> <span style="color: #4f97d7;">USER</span> <span style="color: #2d9574;">'old_app_dev'</span>@<span style="color: #2d9574;">'localhost'</span> IDENTIFIED <span style="color: #4f97d7; font-weight: bold;">BY</span> <span style="color: #2d9574;">'old_app_devpass'</span>;
<span style="color: #4f97d7; font-weight: bold;">GRANT</span> <span style="color: #4f97d7; font-weight: bold;">ALL</span> <span style="color: #4f97d7; font-weight: bold;">ON</span> old_app.* <span style="color: #4f97d7; font-weight: bold;">TO</span> <span style="color: #2d9574;">'old_app_dev'</span>@<span style="color: #2d9574;">'localhost'</span>;
</pre>
</div>

<p>
如果此开发人员离开项目，则有必要将权限分配给其他用户，或者项目参与人增多，则可能需要多个用户。以下是解决该问题的一些方法：
</p>

<p>
不使用角色：更改帐户密码，以便原始开发人员不能使用它，并让新的开发人员使用该帐户：
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #4f97d7; font-weight: bold;">ALTER</span> <span style="color: #4f97d7;">USER</span> <span style="color: #2d9574;">'old_app_dev'</span>@<span style="color: #2d9574;">'localhost'</span> IDENTIFIED <span style="color: #4f97d7; font-weight: bold;">BY</span> <span style="color: #2d9574;">'new_password'</span>;
</pre>
</div>

<p>
使用角色：锁定帐户以防止任何人使用它来连接服务器：
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #4f97d7; font-weight: bold;">ALTER</span> <span style="color: #4f97d7;">USER</span> <span style="color: #2d9574;">'old_app_dev'</span>@<span style="color: #2d9574;">'localhost'</span> ACCOUNT LOCK;
</pre>
</div>

<p>
然后将该帐户视为角色。对于每个新开发项目的开发者，创建一个新帐户并授予其原始开发者帐户：
</p>

<p>
CREATE USER 'new_app_dev1'@'localhost' IDENTIFIED BY 'new_password';
GRANT 'old_app_dev'@'localhost' TO 'new_app_dev1'@'localhost';
</p>

<p>
其效果是将原始开发者帐户权限分配给新帐户。
</p>

<p>
MySQL8.0 的用户和角色管理也越来越像 Oracle 了，8.0 中有不少新的特性，变化还是很大的，需要 DBA 不断的学习和测试，更新对 MySQL 新版的认知，更好地运维 MySQL 数据库。未来 MySQL 数据库自治和智能数据库是必然发展趋势，对 DBA 来说是解放，也是挑战。
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org651ece6" class="outline-2">
<h2 id="org651ece6"><span class="section-number-2">6</span> /etc/my.cnf 文件配置</h2>
<div class="outline-text-2" id="text-6">
<p>
一般情况下，你不需要修改该配置文件，该文件默认配置如下：
</p>

<p>
#+end_src ini
[mysqld]
datadir=/var/lib/mysql
socket=/var/lib/mysql/mysql.sock
</p>

<p>
[mysql.server]
user=mysql
basedir=/var/lib
</p>

<p>
[safe_mysqld]
err-log=/var/log/mysqld.log
pid-file=/var/run/mysqld/mysqld.pid
#+end_src
</p>

<p>
在配置文件中，你可以指定不同的错误日志文件存放的目录，一般你不需要改动这些配置。
</p>
</div>
</div>

<div id="outline-container-orgbafe47b" class="outline-2">
<h2 id="orgbafe47b"><span class="section-number-2">7</span> MySQL 常见命令</h2>
<div class="outline-text-2" id="text-7">
<p>
以下列出了使用 Mysql 数据库过程中常用的命令：
</p>

<div class="org-src-container">
<pre class="src src-sql">USE &#25968;&#25454;&#24211;&#21517; :
# &#36873;&#25321;&#35201;&#25805;&#20316;&#30340; Mysql &#25968;&#25454;&#24211;&#65292;&#20351;&#29992;&#35813;&#21629;&#20196;&#21518;&#25152;&#26377; Mysql &#21629;&#20196;&#37117;&#21482;&#38024;&#23545;&#35813;&#25968;&#25454;&#24211;&#12290;
SHOW DATABASES:
# &#21015;&#20986; MySQL &#25968;&#25454;&#24211;&#31649;&#29702;&#31995;&#32479;&#30340;&#25968;&#25454;&#24211;&#21015;&#34920;&#12290;
SHOW TABLES:
# &#26174;&#31034;&#25351;&#23450;&#25968;&#25454;&#24211;&#30340;&#25152;&#26377;&#34920;&#65292;&#20351;&#29992;&#35813;&#21629;&#20196;&#21069;&#38656;&#35201;&#20351;&#29992; use &#21629;&#20196;&#26469;&#36873;&#25321;&#35201;&#25805;&#20316;&#30340;&#25968;&#25454;&#24211;&#12290;
SHOW COLUMNS <span style="color: #4f97d7; font-weight: bold;">FROM</span> &#25968;&#25454;&#34920;:
# &#26174;&#31034;&#25968;&#25454;&#34920;&#30340;&#23646;&#24615;&#65292;&#23646;&#24615;&#31867;&#22411;&#65292;&#20027;&#38190;&#20449;&#24687; &#65292;&#26159;&#21542;&#20026; <span style="color: #4f97d7; font-weight: bold;">NULL</span>&#65292;&#40664;&#35748;&#20540;&#31561;&#20854;&#20182;&#20449;&#24687;&#12290;
SHOW INDEX <span style="color: #4f97d7; font-weight: bold;">FROM</span> &#25968;&#25454;&#34920;:
# &#26174;&#31034;&#25968;&#25454;&#34920;&#30340;&#35814;&#32454;&#32034;&#24341;&#20449;&#24687;&#65292;&#21253;&#25324; <span style="color: #4f97d7; font-weight: bold;">PRIMARY</span> <span style="color: #4f97d7; font-weight: bold;">KEY</span><span style="color: #4f97d7;">&#65288;</span>&#20027;&#38190;<span style="color: #4f97d7;">&#65289;</span>&#12290;
SHOW <span style="color: #4f97d7; font-weight: bold;">TABLE</span> STATUS <span style="color: #4f97d7; font-weight: bold;">LIKE</span> <span style="color: #4f97d7;">[</span><span style="color: #4f97d7; font-weight: bold;">FROM</span> db_name<span style="color: #4f97d7;">]</span> <span style="color: #4f97d7;">[</span><span style="color: #4f97d7; font-weight: bold;">LIKE</span> <span style="color: #2d9574;">'pattern'</span><span style="color: #4f97d7;">]</span> \G:
# &#35813;&#21629;&#20196;&#23558;&#36755;&#20986; Mysql &#25968;&#25454;&#24211;&#31649;&#29702;&#31995;&#32479;&#30340;&#24615;&#33021;&#21450;&#32479;&#35745;&#20449;&#24687;&#12290;
</pre>
</div>

<p>
数据库 CRUD
</p>

<div class="org-src-container">
<pre class="src src-sql"># &#26174;&#31034;&#25968;&#25454;&#24211;
show databases;
# &#36873;&#25321;&#25968;&#25454;&#24211;
use dbname;
# &#21019;&#24314;&#25968;&#25454;&#24211;
crate database dbname;
# &#21019;&#24314;&#25968;&#25454;&#24211;
<span style="color: #4f97d7; font-weight: bold;">drop</span> database dbname;
</pre>
</div>
</div>
</div>

<div id="outline-container-org9392b14" class="outline-2">
<h2 id="org9392b14"><span class="section-number-2">8</span> References</h2>
<div class="outline-text-2" id="text-8">
<p>
&gt; 本文是我的学习笔记，内容参考了网上资源，为了方便自己查询使用，做了一些修改整理。
&gt; 笔记内容摘录于下列文章，相应权利归属原作者，如有未列出的或有不妥，请联系我立即增补或删除。
</p>

<ul class="org-ul">
<li><a href="http://www.runoob.com/mysql/mysql-tutorial.html">http://www.runoob.com/mysql/mysql-tutorial.html</a></li>
<li><a href="https://www.sohu.com/a/229885311_610509">https://www.sohu.com/a/229885311_610509</a></li>
</ul>
</div>
</div>
